package org.koudai.java.数据类型运算符流程控制语句;

/**
 * @description 基础语法的讲解
 * @Auther: 韩金铭 1329674322@qq.com
 * @Date: 2015/10/3 01:00
 */
//被public标记的是主类,.java文件的名字与主类名字一致
/**
 *public:公共的,被public修饰的内容可以被整个工程可见
 * 注意点:所有代码的执行顺序都是从上往下
 */
public class Demo1 {
    public static void main(String[] args) {
        System.out.println("Hello World");
    }
}
/**
 *1.关键字: class public private static package
 * 2.标识符:由我们自己命名的单词 a2a _aa $$$ ___  错误的:3dd class d@d
 * 3.注释
 * 4.常量:固定不变的量. 分类:整数常量,小数常量,字符常量  1 1.1 'a' "aaa"
 * 5.变量:在内存中开辟了一块空间,可以用于存储数据.但是同一时间只能存储一个值,值可以改变
 * 6.进制转换 二进制 八进制 十进制 十六进制
 * 八进制,十六进制都是为了更好地表示二进制
 */

/**
 * ┌───┐   ┌───┬───┬───┬───┐ ┌───┬───┬───┬───┐ ┌───┬───┬───┬───┐
 * │Esc│   │ F1│ F2│ F3│ F4│ │ F5│ F6│ F7│ F8│ │ F9│F10│F11│F12│ │P/S│S L│P/B│  ┌┐    ┌┐    ┌┐
 * └───┘   └───┴───┴───┴───┘ └───┴───┴───┴───┘ └───┴───┴───┴───┘ └
 * ┌───┬───┬───┬───┬───┬───┬───┬───┬───┬───┬───┬───┬───┬───────┐
 * │~ `│! 1│@ 2│# 3│$ 4│% 5│^ 6│& 7│* 8│( 9│) 0│_ -│+ =│ BacSp │ │Ins│Hom│PUp│ │N L│ / │ * │ - │
 * ├───┴─┬─┴─┬─┴─┬─┴─┬─┴─┬─┴─┬─┴─┬─┴─┬─┴─┬─┴─┬─┴─┬─┴─┬─┴─┬─────┤
 * │ Tab │ Q │ W │ E │ R │ T │ Y │ U │ I │ O │ P │{ [│} ]│ | \ │ │Del│End│PDn│ │ 7 │ 8 │ 9 │   │
 * ├─────┴┬──┴┬──┴┬──┴┬──┴┬──┴┬──┴┬──┴┬──┴┬──┴┬──┴┬──┴┬──┴─────┤
 * │ Caps │ A │ S │ D │ F │ G │ H │ J │ K │ L │: ;│" '│ Enter  │               │ 4 │ 5 │ 6 │   │
 * ├──────┴─┬─┴─┬─┴─┬─┴─┬─┴─┬─┴─┬─┴─┬─┴─┬─┴─┬─┴─┬─┴─┬─┴────────┤
 * │ Shift  │ Z │ X │ C │ V │ B │ N │ M │< ,│> .│? /│  Shift   │     │ ↑ │     │ 1 │ 2 │ 3 │   │
 * ├─────┬──┴─┬─┴──┬┴───┴───┴───┴───┴───┴──┬┴───┼───┴┬────┬────┤
 * │ Ctrl│    │Alt │         Space         │ Alt│    │    │Ctrl│ │ ← │ ↓ │ → │ │   0   │ . │←─┘│
 * └─────┴────┴────┴───────────────────────┴────┴────┴────┴────┘
 **/